'''
环境质量数据总线寻址参数
'''

"发送命令"
# 各云盒二合一和六合一传感器数量（从0开始）
# 云盒地址   2   6    云盒编号
box_num = [[2, 2],  # 1
           [2, 2],  # 2
           [1, 1],  # 3
           [2, 2],  # 4
           [2, 2],  # 5
           [1, 1],  # 6
           [2, 2],  # 7
           [1, 1],  # 8
           [5, 4],  # 9
           [5, 4],  # 10
           [3, 2],  # 11
           [2, 4],  # 12
           [4, 4],  # 13
           [5, 4],  # 14
           [1, 1],  # 15
           [2, 2],  # 16
           [2, 2],  # 17
           [2, 2],  # 18
           [2, 2],  # 19
           [3, 4],  # 20
           [4, 4],  # 21
           [3, 4],  # 22
           [3, 4],  # 23
           [1, 1],  # 24
           [2, 2],  # 25
           [2, 2],  # 26
           [3, 2],  # 27
           [3, 1],  # 28
           [3, 1],  # 29
           [2, 2],  # 30
           [4, 0],  # 31
           [3, 0],  # 32
           [2, 0],  # 33
           [2, 0],  # 34
           [20, 1],  # 35
           [20, 1],  # 36
           [20, 1],  # 37
           [20, 1],  # 38
           [20, 1],  # 39
           [20, 1],  # 40
           [20, 1],  # 41
           [20, 1],  # 42
           ]
# 起始寄存器地址
rgs = 0x00
# 数据长度
len_data = 0x73

"接收数据"
# 各总线最后一个云盒编号（从1开始）
busBox = [0, 8, 10, 14, 19, 23, 27, 34, 36, 38, 40, 42]
# 二合一和六合一数据起始地址和数据占位
two_start = 0
six_start = 20
six_bios = 60  # 六合一地址记为81开始，但实际从20开始
two_len = 4
six_len = 8
# 标号和数据开始地址（从0算起）
pos_name = 0
pos_data = 2
# 二合一和六合一数据类型
two_type = ['temp', 'humi']
six_type = ['pm1', 'pm25', 'pm10', 'temp', 'humi', 'co2']
# 二合一和六合一数据进位
two_carry = [0.1, 0.1]
six_carry = [1, 1, 1, 0.1, 0.1, 1]
